#include <stdint.h>
#include "init.h"

void System_Init(void) {
    // 1. Включаем тактирование порта GPIOB (бит 1 в RCC_AHB1ENR по адресу 0x40023830)
    *(volatile uint32_t *)0x40023830UL |= (1U << 1);

    // 2. Сбрасываем настройки MODER для PB2, PB5, PB6, PB8, PB9 (адрес 0x40020400)
    *(volatile uint32_t *)0x40020400UL &= ~((3U << 4) | (3U << 10) | (3U << 12) | (3U << 16) | (3U << 18));

    // 3. Настраиваем PB6, PB8, PB9 на выход (01 в соответствующие пары бит MODER)
    *(volatile uint32_t *)0x40020400UL |= ((1U << 12) | (1U << 16) | (1U << 18));

    // 4. Включаем внутреннюю подтяжку Pull-Up (01) для кнопок PB2 и PB5 в PUPDR (адрес 0x4002040C)
    *(volatile uint32_t *)0x4002040CUL &= ~((3U << 4) | (3U << 10));
    *(volatile uint32_t *)0x4002040CUL |=  ((1U << 4) | (1U << 10));

    // 5. Гасим светодиоды при старте в ODR (адрес 0x40020414)
    *(volatile uint32_t *)0x40020414UL &= ~((1U << 2) | (1U << 6) | (1U << 8) | (1U << 9));
}